probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
void addLightJson(aJsonObject* root, int numberOfTheLight, LightHandler *lightHandler);
void lightsIdFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
  int numberOfTheLight = atoi(whandler->getWildCard(1).c_str()) - 1;
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  switch (method) {
    case HTTP_GET: {
      aJsonObject *root;
      root = aJson.createObject();
      addLightJson(root, numberOfTheLight, handler);
      sendJson(root);
      break;
    }
    case HTTP_PUT:
      // XXX do something here
      sendUpdated();
      break;
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsIdStateFn(WcFnRequestHandler *whandler, String requestUri, HTTPMethod method) {
  int numberOfTheLight = atoi(whandler->getWildCard(1).c_str()) - 1;
  LightHandler *handler = LightService.getLightHandler(numberOfTheLight);
  if (!handler) {
    sendError(3, requestUri, "Requested light not available");
    return;
  }

  switch (method) {
    case HTTP_PUT: {
      Serial.print("JSON Body:");
      Serial.println(HTTP.arg("plain"));
      aJsonObject* parsedRoot = aJson.parse(( char*) HTTP.arg("plain").c_str());
      if (!parsedRoot) {
        // unparseable json
        sendError(2, requestUri, "Bad JSON body in request");
        return;
      }
      HueLightInfo currentInfo = handler->getInfo(numberOfTheLight);
      HueLightInfo newInfo;
      if (!parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        aJson.deleteItem(parsedRoot);
        return;
      }
      handler->handleQuery(numberOfTheLight, newInfo, parsedRoot);
      aJson.deleteItem(parsedRoot);
      break;
    }
    default:
      sendError(4, requestUri, "Light method not supported");
      break;
  }
}

void lightsNewFn(WcFnRequestHandler *handler, String requestUri, HTTPMethod method) {
  // dump empty object
  aJsonObject *lights = aJson.createObject();
  sendJson(lights);
}

void LightServiceClass::begin() {
  macString = String(WiFi.macAddress());
  bridgeIDString = macString;
  bridgeIDString.replace(":", "");
  bridgeIDString = bridgeIDString.substring(0, 6) + "FFFE" + bridgeIDString.substring(6);
  ipString = StringIPaddress(WiFi.localIP());
  netmaskString = StringIPaddress(WiFi.subnetMask());
  gatewayString = StringIPaddress(WiFi.gatewayIP());

  Serial.print("Starting HTTP at ");
  Serial.print(WiFi.localIP());
  Serial.print(":");
  Serial.println(80);

  HTTP.on("/description.xml", HTTP_GET, descriptionFn);
  on(configFn, "/api/*/config", HTTP_GET);
  on(configFn, "/api/config", HTTP_GET);
  on(wholeConfigFn, "/api/*", HTTP_GET);
  on(authFn, "/api", HTTP_GET);
  on(unimpFn, "/api/*/schedules", HTTP_GET);
  on(unimpFn, "/api/*/rules", HTTP_GET);
  on(unimpFn, "/api/*/sensors", HTTP_GET);
  on(scenesFn, "/api/*/scenes", HTTP_ANY);
  on(scenesIdFn, "/api/*/scenes/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lightstates/*", HTTP_ANY);
  on(scenesIdLightFn, "/api/*/scenes/*/lights/*/state", HTTP_ANY);
  on(groupsFn, "/api/*/groups", HTTP_ANY);
  on(groupsIdFn, "/api/*/groups/*", HTTP_ANY);
  on(groupsIdActionFn, "/api/*/groups/*/action", HTTP_ANY);
  on(lightsFn, "/api/*/lights", HTTP_ANY);
  on(lightsNewFn, "/api/*/lights/new", HTTP_ANY);
  on(lightsIdFn, "/api/*/lights/*", HTTP_ANY);
  on(lightsIdStateFn, "/api/*/lights/*/state", HTTP_ANY);

  HTTP.begin();

  Serial.println("Starting SSDP...");
  SSDP.begin();
  SSDP.setSchemaURL((char*)"description.xml");
  SSDP.setHTTPPort(80);
  SSDP.setName((char*)"Philips hue clone");
  SSDP.setSerialNumber((char*)"001788102201");
  SSDP.setURL((char*)"index.html");
  SSDP.setModelName((char*)"IpBridge");
  SSDP.setModelNumber((char*)"0.1");
  SSDP.setModelURL((char*)"http://www.meethue.com");
  SSDP.setManufacturer((char*)"Royal Philips Electronics");
  SSDP.setManufacturerURL((char*)"http://www.philips.com");
  SSDP.setDeviceType((char*)"upnp:rootdevice");
  SSDP.setMessageFormatCallback(ssdpMsgFormatCallback);
  Serial.println("SSDP Started");
}

void LightServiceClass::update() {
  HTTP.handleClient();
}

void sendJson(aJsonObject *root)
{
  // Take aJsonObject and print it to Serial and to WiFi
  // From https://github.com/pubnub/msp430f5529/blob/master/msp430f5529.ino
  char *msgStr = aJson.print(root);
  aJson.deleteItem(root);
  Serial.println(millis());
  Serial.println(msgStr);
  HTTP.send(200, "text/plain", msgStr);
  free(msgStr);
}

// ==============================================================================================================
// Color Conversion
// ==============================================================================================================
// TODO: Consider switching to something along the lines of
// https://github.com/patdie421/mea-edomus/blob/master/src/philipshue_color.c
// and/ or https://github.com/kayno/arduinolifx/blob/master/color.h
// for color coversions instead
// ==============================================================================================================

// Based on http://stackoverflow.com/questions/22564187/rgb-to-philips-hue-hsb
// The code is based on this brilliant note: https://github.com/PhilipsHue/PhilipsHueSDK-iOS-OSX/commit/f41091cf671e13fe8c32fcced12604cd31cceaf3

RgbColor getXYtoRGB(float x, float y, int brightness_raw) {
  float brightness = ((float)brightness_raw) / 255.0f;
  float bright_y = brightness / y;
  float X = x * bright_y;
  float Z = (1 - x - y) * bright_y;

  // convert to RGB (0.0-1.0) color space
  float R = X * 1.4628067 - brightness * 0.1840623 - Z * 0.2743606;
  float G = -X * 0.5217933 + brightness * 1.4472381 + Z * 0.0677227;
  float B = X * 0.0349342 - brightness * 0.0968930 + Z * 1.2884099;

  // apply inverse 2.2 gamma
  float inv_gamma = 1.0 / 2.4;
  float linear_delta = 0.055;
  float linear_interval = 1 + linear_delta;
  float r = R <= 0.0031308 ? 12.92 * R : (linear_interval) * pow(R, inv_gamma) - linear_delta;
  float g = G <= 0.0031308 ? 12.92 * G : (linear_interval) * pow(G, inv_gamma) - linear_delta;
  float b = B <= 0.0031308 ? 12.92 * B : (linear_interval) * pow(B, inv_gamma) - linear_delta;

  return RgbColor(r * COLOR_SATURATION,
                  g * COLOR_SATURATION,
                  b * COLOR_SATURATION);
}

int getHue(HsbColor hsb) {
  return hsb.H * 360 * 182.04;
}

int getSaturation(HsbColor hsb) {
  return hsb.S * COLOR_SATURATION;
}

