probonopd/ESP8266HueEmulator/ESP8266HueEmulator/LightService.cpp
aJsonObject *validateGroupCreateBody(String body) {
  aJsonObject *root = aJson.parse(( char*) body.c_str());
  aJsonObject* jName = aJson.getObjectItem(root, "name");
  aJsonObject* jLights = aJson.getObjectItem(root, "lights");
  if (!jName || !jLights) {
    return nullptr;
  }
  return root;
}

void applyConfigToLightMask(unsigned int lights) {
  Serial.print("JSON Body:");
  Serial.println(HTTP.arg("plain"));
  aJsonObject* parsedRoot = aJson.parse(( char*) HTTP.arg("plain").c_str());
  if (parsedRoot) {
    for (int i = 0; i < LightService.getLightsAvailable(); i++) {
      LightHandler *handler = LightService.getLightHandler(i);
      HueLightInfo currentInfo = handler->getInfo(i);
      HueLightInfo newInfo;
      if (parseHueLightInfo(currentInfo, parsedRoot, &newInfo)) {
        handler->handleQuery(i, newInfo, parsedRoot);
      }
    }
    aJson.deleteItem(parsedRoot);

    // As per the spec, the response can be "Updated." for memory-constrained devices
    sendUpdated();
  } else if (HTTP.arg("plain") != "") {
    // unparseable json
    sendError(2, "groups/0/action", "Bad JSON body in request");
  }
}

// returns true on failure
bool updateGroupSlot(int slot, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("JSON Body:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "groups/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightGroups[slot]) {
    delete lightGroups[slot];
    lightGroups[slot] = nullptr;
  }
  if (body != "") {
    lightGroups[slot] = new LightGroup(root);
    aJson.deleteItem(root);
  }
  return false;
}

void groupCreationHandler() {
  // handle group creation
  // find first available group slot
  int availableSlot = -1;
  for (int i = 0; i < 16; i++) {
    if (!lightGroups[i]) {
      availableSlot = i;
      break;
    }
  }
  if (availableSlot == -1) {
    // throw error no new groups allowed
    sendError(301, "groups", "Groups table full");
    return;
  }
  if (!updateGroupSlot(availableSlot, HTTP.arg("plain"))) {
    String slot = "";
    slot += (availableSlot + 1);
    sendSuccess("id", slot);
  }
}

aJsonObject *getGroupJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightGroups[i]) {
      String sIndex = "";
      sIndex += (i + 1);
      aJson.addItemToObject(root, sIndex.c_str(), lightGroups[i]->getJson());
    }
  }
  return root;
}

void groupListingHandler() {
  sendJson(getGroupJson());
}

LightGroup *lightScenes[16] = {nullptr, };

int findSceneIndex(String id) {
  int index = -1;
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return i;
      }
    } else if (index == -1) {
      index = i;
    }
  }
  return index;
}

bool updateSceneSlot(int slot, String id, String body) {
  aJsonObject *root;
  if (body != "") {
    Serial.print("JSON Body:");
    Serial.println(body);
    root = validateGroupCreateBody(body);
  }
  if (!root && body != "") {
    // throw error bad body
    sendError(2, "scenes/" + (slot + 1), "Bad JSON body");
    return true;
  }
  if (lightScenes[slot]) {
    delete lightScenes[slot];
    lightScenes[slot] = nullptr;
  }
  if (body != "") {
    lightScenes[slot] = new LightGroup(root);
    aJson.deleteItem(root);
  }
  return false;
}

void sceneCreationHandler(String id) {
  int sceneIndex = findSceneIndex(id);
  // handle scene creation
  // find first available scene slot
  if (sceneIndex == -1) {
    // throw error no new scenes allowed
    sendError(301, "scenes", "Scenes table full");
    return;
  }
  // updateSceneSlot sends failure messages
  if (!updateSceneSlot(sceneIndex, id, HTTP.arg("plain"))) {
    if (id == "") {
      id = String(sceneIndex);
    }
    lightScenes[sceneIndex]->id = id;
    sendSuccess("id", id);
    return;
  }
}

aJsonObject *getSceneJson() {
  // iterate over groups and serialize
  aJsonObject *root = aJson.createObject();
  for (int i = 0; i < 16; i++) {
    if (lightScenes[i]) {
      aJson.addItemToObject(root, lightScenes[i]->id.c_str(), lightScenes[i]->getSceneJson());
    }
  }
  return root;
}

void sceneListingHandler() {
  sendJson(getSceneJson());
}

LightGroup *findScene(String id) {
  for (int i = 0; i < 16; i++) {
    LightGroup *scene = lightScenes[i];
    if (scene) {
      if (scene->id == id) {
        return scene;
      }
    }
  }
  return nullptr;
}

void scenesHandler(String user, String uri) {
  uri = trimSlash(uri.substring(6));
  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        sceneListingHandler();
        break;
      case HTTP_POST:
        sceneCreationHandler("");
        break;
      default:
        sendError(4, "/api/" + user + "/scenes", "Scene method not supported");
        break;
    }
    return;
  }

  int nextSlash = uri.indexOf("/");
  String sceneId;
  if (nextSlash == -1) {
    sceneId = uri;
    uri = "";
  } else {
    sceneId = uri.substring(0, nextSlash);
    uri = trimSlash(uri.substring(nextSlash));
  }
  LightGroup *scene = findScene(sceneId);

  if (uri == "") {
    switch (HTTP.method()) {
      case HTTP_GET:
        if (scene) {
          sendJson(scene->getSceneJson());
        } else {
          sendError(3, "/scenes/"+sceneId, "Cannot retrieve scene that does not exist");
        }
        break;
      case HTTP_PUT:
        // validate body, delete old group, create new group
        sceneCreationHandler(sceneId);
	      // XXX not a valid response according to API
        sendUpdated();
        break;
      case HTTP_DELETE: {
        if (scene) {
          updateSceneSlot(findSceneIndex(sceneId), sceneId, "");
        } else {
          sendError(3, "/scenes/"+sceneId, "Cannot delete scene that does not exist");
        }
        String message = "/scenes/";
        message += sceneId;
        message += " deleted";
        sendSuccess(message);
        break;
      }
      default: {
        String path = "/api/";
        path += user;
        path += "/scenes";
        sendError(4, path, "Scene method not supported");
        break;
      }
    }
    return;
  }

